In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\akrit\appdata\local\programs\python\python312\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\akrit\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\akrit\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\akrit\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\akrit\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\akrit\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
# data to series form
marks=[85,91,76,76,56]
std_marks=pd.Series(marks)
print(std_marks)

0    85
1    91
2    76
3    76
4    56
dtype: int64

In [4]:

marks=pd.Series([85,91,76,76,56],index=["Math","Science","English","Hindi","Geo"])
print(marks)

Math       85
Science    91
English    76
Hindi      76
Geo        56
dtype: int64

In [5]:
# updating series by index numbers
marks[1]=55
print(marks)

Math       85
Science    55
English    76
Hindi      76
Geo        56
dtype: int64

C:\Users\Akrit\AppData\Local\Temp\ipykernel_14756\3745016961.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  marks[1]=55

In [6]:
# performing some arithmetic functions

upd_marks=pd.Series([85,91,76,76,56])
print(upd_marks + 5)

0    90
1    96
2    81
3    81
4    61
dtype: int64

In [7]:
# Identifying missing value in dataset

missing_marks=pd.Series([85,91,76,None,56])
print(missing_marks)

0    85.0
1    91.0
2    76.0
3     NaN
4    56.0
dtype: float64

In [8]:
# handling missing value
missing_marks.fillna(50,inplace=True)
print(missing_marks)

0    85.0
1    91.0
2    76.0
3    50.0
4    56.0
dtype: float64

In [9]:
# DataFrame- two dimensional data with rows & columns

In [10]:
data={
    "Name":["Akriti","Sakshi","Komal","Shreya"],
    "Age":[20,21,23,25],
    "Trade":["AIPA","CSA","EM","COPA"]
}
#convert the data in 2-D form (DataFrame)
df=pd.DataFrame(data)
print(df)

     Name  Age Trade
0  Akriti   20  AIPA
1  Sakshi   21   CSA
2   Komal   23    EM
3  Shreya   25  COPA

In [11]:
df["Trade"]

0    AIPA
1     CSA
2      EM
3    COPA
Name: Trade, dtype: object

In [12]:
#multiple column select
df[["Name","Trade"]]

     Name Trade
0  Akriti  AIPA
1  Sakshi   CSA
2   Komal    EM
3  Shreya  COPA

In [13]:
# finding by label based integer
df.loc[0]  #particular row data

Name     Akriti
Age          20
Trade      AIPA
Name: 0, dtype: object

In [14]:
# entre values by position even if the index label is different
df.iloc[0]

Name     Akriti
Age          20
Trade      AIPA
Name: 0, dtype: object

In [15]:
## FILTER DATA

In [16]:
# single condition
df[df["Age"]>23]

     Name  Age Trade
3  Shreya   25  COPA

In [17]:
#multiple conditions
df[(df["Age"]>23) & (df["Trade"]=="COPA")]

     Name  Age Trade
3  Shreya   25  COPA

In [18]:
#shorting data

In [19]:
#ascending order
df.sort_values(by="Age")

     Name  Age Trade
0  Akriti   20  AIPA
1  Sakshi   21   CSA
2   Komal   23    EM
3  Shreya   25  COPA

In [20]:
#descending
df.sort_values(by="Name",ascending=False)

     Name  Age Trade
3  Shreya   25  COPA
1  Sakshi   21   CSA
2   Komal   23    EM
0  Akriti   20  AIPA

In [ ]:
#handling missing values

In [28]:
data={
    "Name":["Amit","Ajeet","Raj","Suraj","Saksham"],
    "Marks":[94,None,75,99,83]
}
df=pd.DataFrame(data)

In [29]:
#check null values
df.isnull()

    Name  Marks
0  False  False
1  False   True
2  False  False
3  False  False
4  False  False

In [ ]:
#remove null value
df.dropna()

In [ ]:
#fill null by specify value
df.fillna(70)

In [30]:
#fill missing value t= with average of other values
df["Marks"].fillna(df["Marks"].mean(),inplace=True)

C:\Users\Akrit\AppData\Local\Temp\ipykernel_14756\3872723831.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Marks"].fillna(df["Marks"].mean(),inplace=True)

In [24]:
df

      Name  Marks
0     Amit  94.00
1    Ajeet  83.75
2      Raj  95.00
3    Suraj  63.00
4  Saksham  83.00

In [ ]:
# grouping data

In [34]:
data={
    "Trade":["AIPA","AIPA","COSMO","CSA","COPA","COSMO","CSA"],
    "Students":[20,20,40,35,30,50,10]
}
df=pd.DataFrame(data)
df

   Trade  Students
0   AIPA        20
1   AIPA        20
2  COSMO        40
3    CSA        35
4   COPA        30
5  COSMO        50
6    CSA        10

In [35]:
df.groupby("Trade")["Students"].sum()

Trade
AIPA     40
COPA     30
COSMO    90
CSA      45
Name: Students, dtype: int64

In [36]:
df.groupby("Trade")["Students"].mean()

Trade
AIPA     20.0
COPA     30.0
COSMO    45.0
CSA      22.5
Name: Students, dtype: float64

In [37]:
df.groupby("Trade")["Students"].count()

Trade
AIPA     2
COPA     1
COSMO    2
CSA      2
Name: Students, dtype: int64

In [38]:
# used for summarizing data
df.groupby("Trade")["Students"].agg(["sum","mean","count"])

       sum  mean  count
Trade
AIPA    40  20.0      2
COPA    30  30.0      1
COSMO   90  45.0      2
CSA     45  22.5      2

In [39]:
df=pd.read_csv("salesdata.csv")
df

     ID    Name   Age  State Sales
0     1    Amit  25.0     UP  5000
1     2    Neha  22.0  Delhi  7000
2     3    Ravi   NaN  Bihar  6000
3     4  Sunita  28.0     UP   NaN
4     5    Anil  35.0  Delhi  8000
..  ...     ...   ...    ...   ...
95   96  Alisha  23.0  Bihar  4600
96   97   Shyam   NaN  Delhi  8300
97   98  Poonam  25.0     UP  5400
98   99   Vinod  40.0  Bihar  8900
99  100    Riya  22.0  Delhi   NaN

[100 rows x 5 columns]

In [40]:
#find missing values
df.isnull

<bound method DataFrame.isnull of      ID    Name   Age  State Sales
0     1    Amit  25.0     UP  5000
1     2    Neha  22.0  Delhi  7000
2     3    Ravi   NaN  Bihar  6000
3     4  Sunita  28.0     UP   NaN
4     5    Anil  35.0  Delhi  8000
..  ...     ...   ...    ...   ...
95   96  Alisha  23.0  Bihar  4600
96   97   Shyam   NaN  Delhi  8300
97   98  Poonam  25.0     UP  5400
98   99   Vinod  40.0  Bihar  8900
99  100    Riya  22.0  Delhi   NaN

[100 rows x 5 columns]>

In [50]:
df.isna().sum()

ID       0
Name     0
Age      0
State    0
Sales    0
dtype: int64

In [42]:
df.head()

   ID    Name   Age  State Sales
0   1    Amit  25.0     UP  5000
1   2    Neha  22.0  Delhi  7000
2   3    Ravi   NaN  Bihar  6000
3   4  Sunita  28.0     UP   NaN
4   5    Anil  35.0  Delhi  8000

In [43]:
df.tail()

     ID    Name   Age  State Sales
95   96  Alisha  23.0  Bihar  4600
96   97   Shyam   NaN  Delhi  8300
97   98  Poonam  25.0     UP  5400
98   99   Vinod  40.0  Bihar  8900
99  100    Riya  22.0  Delhi   NaN

In [45]:
df["Sales"].fillna(6500,inplace=True)
df

     ID    Name   Age  State Sales
0     1    Amit  25.0     UP  5000
1     2    Neha  22.0  Delhi  7000
2     3    Ravi   NaN  Bihar  6000
3     4  Sunita  28.0     UP  6500
4     5    Anil  35.0  Delhi  8000
..  ...     ...   ...    ...   ...
95   96  Alisha  23.0  Bihar  4600
96   97   Shyam   NaN  Delhi  8300
97   98  Poonam  25.0     UP  5400
98   99   Vinod  40.0  Bihar  8900
99  100    Riya  22.0  Delhi  6500

[100 rows x 5 columns]

In [48]:
df["Age"].fillna(df["Age"].mean(),inplace=True)
df

C:\Users\Akrit\AppData\Local\Temp\ipykernel_14756\2079956988.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].mean(),inplace=True)

     ID    Name        Age  State Sales
0     1    Amit  25.000000     UP  5000
1     2    Neha  22.000000  Delhi  7000
2     3    Ravi  30.917647  Bihar  6000
3     4  Sunita  28.000000     UP  6500
4     5    Anil  35.000000  Delhi  8000
..  ...     ...        ...    ...   ...
95   96  Alisha  23.000000  Bihar  4600
96   97   Shyam  30.917647  Delhi  8300
97   98  Poonam  25.000000     UP  5400
98   99   Vinod  40.000000  Bihar  8900
99  100    Riya  22.000000  Delhi  6500

[100 rows x 5 columns]

In [49]:
df["State"].fillna(df["State"].mode()[0],inplace=True)
df

C:\Users\Akrit\AppData\Local\Temp\ipykernel_14756\2637289285.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["State"].fillna(df["State"].mode()[0],inplace=True)

     ID    Name        Age  State Sales
0     1    Amit  25.000000     UP  5000
1     2    Neha  22.000000  Delhi  7000
2     3    Ravi  30.917647  Bihar  6000
3     4  Sunita  28.000000     UP  6500
4     5    Anil  35.000000  Delhi  8000
..  ...     ...        ...    ...   ...
95   96  Alisha  23.000000  Bihar  4600
96   97   Shyam  30.917647  Delhi  8300
97   98  Poonam  25.000000     UP  5400
98   99   Vinod  40.000000  Bihar  8900
99  100    Riya  22.000000  Delhi  6500

[100 rows x 5 columns]

In [51]:
df["State"].unique()

array(['UP', 'Delhi', 'Bihar', 'delhi', 'Up'], dtype=object)

In [52]:
df["State"]=df["State"].str.title()

In [53]:
df["State"].unique()

array(['Up', 'Delhi', 'Bihar'], dtype=object)

In [60]:
df

     ID    Name        Age  State Sales
0     1    Amit  25.000000     Up  5000
1     2    Neha  22.000000  Delhi  7000
2     3    Ravi  30.917647  Bihar  6000
3     4  Sunita  28.000000     Up  6500
4     5    Anil  35.000000  Delhi  8000
..  ...     ...        ...    ...   ...
95   96  Alisha  23.000000  Bihar  4600
96   97   Shyam  30.917647  Delhi  8300
97   98  Poonam  25.000000     Up  5400
98   99   Vinod  40.000000  Bihar  8900
99  100    Riya  22.000000  Delhi  6500

[100 rows x 5 columns]

In [61]:
dup=df.duplicated()

In [62]:
dup

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

In [63]:
df.duplicated().sum()

np.int64(0)

In [64]:
print(dup.sum())

0